{
  "source_url": "https://discourse.mcneel.com/t/initial-help-and-pointers-needed-scripting-for-grasshopper-rhino-on-mac/129189",
  "topic_id": 129189,
  "title": "Initial Help and pointers needed. Scripting for grasshopper & rhino on Mac",
  "question": "Setup & Context: Macbook M1; Rhino7; Python; Grasshopper\n\n\nHey Experts of Rhinoceros!\n\nIm coming to you in a dark hour.\n\nAt the moment im trying to write a python script in rhino that will execute & bake a GH model,\n\nrun some validations and print the output. (This should happen in a loop many many times with different parameter inputs for the GH file)\n\n\nThe key challenge for me is finding information about syntax and fighting the Rhino Script Editor on Mac.\n\n\nI have a Software development background and the editor seems like … lets say it does not seem suited for productive work. I feel like my first day of programming again. I cannot find any useful information or documentation or guides.\n\nSources like \nhttps://developer.rhino3d.com/\n offer only very little very specific examples, and the missing autocompletion in the editor (I know there is some in like 1% of cases and I call that missing then) make it feel like its impossible to get more info.\n\n\nIve also tried to use an external editor but failed to get that setup, again due to me not being able to find the information I need. I tried to install the rhinoscriptsyntax package, which does not exist it seems not on GitHub not anywhere I found. I looked for “rhino-python” which runs only under 2.7 and is outdated and does not seem to work well either. So that path also feels like a dead end without help.\n\n\nSo I guess my main question is:\n\nWhat am I missing is there a better source of information? - how do I get the rhino packages to run under macOS so that I can enjoy actual autocompletion? And where do I find meaningful guides on simple things like how to select, delete, export etc. objects that goes beyond the sources above?\n\n(There I did find a little documentation to stuff like rs.DeleteObject, which sounds like it would delete smth, but seems to be a prompt for the user to click on the object to delete, which is not what I need, but the doc ends there and what call I need to actually delete things I dont know \n...",
  "code_blocks": [
    {
      "code": "import rhinoscriptsyntax as rs\nimport inspect\n\nprint inspect.getsource(rs.DeleteObject)",
      "language": "python",
      "author": "diff-arch",
      "post_number": 2,
      "is_solution": false
    }
  ],
  "tags": [
    "file-io",
    "geometry",
    "grasshopper",
    "python",
    "rhinoscriptsyntax"
  ],
  "has_accepted_answer": false,
  "category_id": 2,
  "posts_count": 9,
  "views": 1553
}