{
  "source_url": "https://discourse.mcneel.com/t/the-rhino-python-package-for-the-atom-text-editor-and-rhino-for-mac/15907",
  "topic_id": 15907,
  "title": "The rhino-python package for the Atom text editor and Rhino for Mac",
  "question": "NOTE: This thread is obsolete.  Go \nhere\n to read about setting up Python scripting on Rhino for Mac\n\n\nWe created a new package called rhino-python for the \nAtom text editor\n that in combination with \nRhino 5 for Mac Build 5A671\n provides code completion for RhinoCommon and provides a convenient way to launch your python scripts.\n\n\nSetup:\n\n\n\n\nDownload and install \nRhino 5 for Mac Build 5A671\n\n\n\n\nDownload and install the \nAtom text editor\n (tested with version 0.174.0)\n\n\nFrom the “Atom” menu select “Install Shell Commands”\n\n\nClose Atom and open a Terminal window\n\n\nIn the terminal window command prompt type:\n\n\napm install autocomplete-plus@1.1.0 apm install rhino-python@0.5.3\n\n\n\n\n\n\nQuick Start:\n\n\n\n\nFrom Rhino run the StartAtomEditorListener command.\n\n\n\nignore the error: “looking for …PlatformServices.dll could not find file”.  That missing file is not necessary and the error message won’t be in the next wip release of Rhino.\n\n\n\n\n\n\nLaunch the Atom editor and save the “untitled” document as \nmypythonscript.py\n.  The file needs to have a “.py” extension for the rhino-python package to be activated.\n\n\nType \"import \" (trailing space) and a window with completion data will pop up.  If too much time elapsed between typing the last two characters (t and space) the completion window will not open.  If it didn’t you can open it by pressing the shift-ctrl-space keys.\n\n\nAs you type “rhinos” you’ll see the completion data being filtered until the only option left is “rhinoscriptsyntax”.  Press the “tab” key to accept it.  Finish the line so it looks like this: import rhinoscriptsyntax as rs\n\n\nOn the next line type “from Rhino.Geometry import Point3d”.  The completion data will pop up for “Rhino”, “Geometry”, and “Point3d”.  Press the tab key to accept each.\n\n\nFor the next line type rs.AddCircle(Point3d.Origin, 5.0) and again notice the completion window after each “.” and keep typing until the desired data is highlighted in the completion window.  Press the tab key to accept.  Aft...",
  "code_blocks": [
    {
      "code": "import rhinoscriptsyntax as rs\n\nrs.AddPoint(0,0,0)",
      "language": "python",
      "author": "jeff_hammond",
      "post_number": 3,
      "is_solution": false
    }
  ],
  "tags": [
    "csharp",
    "file-io",
    "geometry",
    "python",
    "rhinocommon",
    "rhinoscriptsyntax"
  ],
  "has_accepted_answer": false,
  "category_id": 11,
  "posts_count": 91,
  "views": 18468
}