{
  "source_url": "https://discourse.mcneel.com/t/repeatable-crash-with-python-script/24567",
  "topic_id": 24567,
  "title": "Repeatable crash with python script",
  "question": "Hi all,\n\n\nI have been experiencing consistent crashes with a certain number of Python scripts running on Mac Rhino, they would cause Rhino to crash as soon as I hit run.  I have been able to narrow it down to one particular rhinoscript method, although it’s possible there may be more.  It’s also possible that this is related to a certain number of rhino-python incompatibilities caused by the update to ironpython 2.7.10 that came with the latest update to Mac OS 10.10.5…  One of these crashes also froze the entire system upon trying to restart Rhino…  (I know Marlin will say this is not possible, but it did indeed happen). Note these crashes are also happening with the latest Mac Rhino WIP.\n\n\nHere’s the script:\n\n\nimport rhinoscriptsyntax as rs\nprint \"Hello World\"\n#folder=rs.BrowseForFolder(rs.WorkingFolder(),\"Browse for folder\",\"Dialog title\")\n\n\n\nRun the script as is first (with the last line commented out).  Here it runs fine. Then uncomment the last line and run it again.  Here instant crash in both 5.0.2 and WIP.\n\n\nAnyone else interested in testing?  \n@dan\n, \n@Alain\n, \n@marlin\n\n\nInteresting side note: when the release version crashes, I get the message below when trying to re-open:\n\n\n \n\n\nExcept the version I have installed is the latest release version (5A865), and even downloading and re-installing via the links doesn’t change anything…  The WIP I have is also the latest - 5B125w.\n\n\nThanks,\n\n–Mitch",
  "code_blocks": [
    {
      "code": "import rhinoscriptsyntax as rs\nprint \"Hello World\"\n#folder=rs.BrowseForFolder(rs.WorkingFolder(),\"Browse for folder\",\"Dialog title\")",
      "language": "python",
      "author": "Helvetosaur",
      "post_number": 1,
      "is_solution": false
    }
  ],
  "tags": [
    "file-io",
    "geometry",
    "python",
    "rhinoscriptsyntax"
  ],
  "has_accepted_answer": false,
  "category_id": 5,
  "posts_count": 7,
  "views": 1770
}