{
  "source_url": "https://discourse.mcneel.com/t/wish-for-rhino-6-bom-generator/3355",
  "topic_id": 3355,
  "title": "Wish For Rhino 6: BOM Generator",
  "question": "I would really like to see a ‘Bill of Materials Generator’ in Rhino 6. The Generator would basically take your work and generate a cost estimate for you based on your assigned materials and/or various pre-made objects you have input into your work (i.e. number of buttons for a shirt you want to create, or feet of steel piping and bolts, or number of light bulbs etc…).\n\n\nso you would take a pipe shape you have created, assign to it the material ‘steel’ - and from this information the cost of steel piping would be generated in a ‘bill of materials’ for your work, from your assigned sources, from your own database or from various online vendors.\n\n\nYou could give an assignment to an object that does not look like what it is supposed to be. For example create a cube and give it the assignment, ‘Halco 6321 - 60 Watt - A19 - Frosted - 5,000 Life Hours - 510 Lumens - 130 Volt’ light bulb. Your hypothetical project calls for 100 of these light bulbs so you place the 100 cu bes where they belong in your project and the BOM Generator will create a cost estimate for you from this information. This saves time and lightens the load on your computer.\n\n\nsupplying cost estimates with work makes a lot of sense and makes the accountant happier. I believe this would be a great addition to the Rhino software package.",
  "code_blocks": [
    {
      "code": "import scriptcontext as sc\nimport rhinoscriptsyntax as rs\n\n\npgs = sc.doc.Views.GetPageViews()\nfor pg in pgs:\n    print (pg.PageName)",
      "language": "python",
      "author": "Japhy",
      "post_number": 27,
      "is_solution": false
    },
    {
      "code": "import Rhino as rc\nimport scriptcontext as sc\nimport rhinoscriptsyntax as rs\n\n# Set context to Rhino document and disable redraw\nsc.doc = rc.RhinoDoc.ActiveDoc\nrs.EnableRedraw(False)\n\n#Do something with the Rhino document\n\n# Set context back to Grasshopper\nrs.EnableRedraw(True)\nsc.doc = ghdoc",
      "language": "python",
      "author": "Japhy",
      "post_number": 27,
      "is_solution": false
    }
  ],
  "tags": [
    "file-io",
    "geometry",
    "grasshopper",
    "materials",
    "python",
    "rhinoscriptsyntax"
  ],
  "has_accepted_answer": false,
  "category_id": 1,
  "posts_count": 28,
  "views": 8636
}