{
  "source_url": "https://discourse.mcneel.com/t/rhino-pythonscript-commands-slower-than-equivalent-vbscript/43975",
  "topic_id": 43975,
  "title": "Rhino PythonScript commands slower than equivalent VBScript?",
  "question": "Hi everyone,\n\n\nFirst of all, I am using Rhino5(64-bit) on Windows 7.\n\n\nTo give some background on the problem I am having, I have rewritten a VBScript using Python for Rhino (personal preferences, I would like to stick to python for the ‘simple’ scripts I am doing), which allows the user to select surfaces, which are then exported in a .csv file where we can find (SurfaceName, SurfaceID, SurfaceLayerName, SurfaceArea, SurfaceAreaCentroid[X], SurfaceAreaCentroid[Y], SurfaceAreaCentroid[Z], SurfaceNormalVector[X], SurfaceNormalVector[Y], SurfaceNormalVector[Z]), each line corresponding to one of the surfaces exported.\n\n\nNow, my issue is that when I run both codes, which are very similar and rely on the exact same rhino commands, on a rhino model of a stadium (which is split in 1500 small surfaces), \nthe VBScript takes 1min30 while the PythonScript takes 5min to produce the same result\n.\n\n\nI did many versions of the python code where I have been optimising string concatenation and writing operations, but in the end it was not very relevant because when I study the time taken by the commands in the for loop, \nit appears that the bottleneck is when I extract the Area and the AreaCentroid of the surface (each taking around 2min30, so both together are nearly 100% of execution time)\n. But both the VBScrip and the Python script use the methods SurfaceArea() and SurfaceAreaCentroid().\n\n\n\tfor strSurfaceID in arrSurfaceIDs:\n\n\t\t(...some other code here...)\n\n\t\tarrSurfaceArea = rs.SurfaceArea(strSurfaceID)\n\t\tarrSurfaceCentroid = rs.SurfaceAreaCentroid(strSurfaceID)\n\n\t\t(...some other code here...)\n\n\n\nSo, in conclusion, I’m wondering why those \nexact same commands\n are executed faster by VB than Python.\n\n\nMany thanks for your attention, I look forward to discuss this.\n\n\nRegards,\n\n\nDamien",
  "code_blocks": [
    {
      "code": "for strSurfaceID in arrSurfaceIDs:\n\n\t\t(...some other code here...)\n\n\t\tarrSurfaceArea = rs.SurfaceArea(strSurfaceID)\n\t\tarrSurfaceCentroid = rs.SurfaceAreaCentroid(strSurfaceID)\n\n\t\t(...some other code here...)",
      "language": "python",
      "author": "Damien2",
      "post_number": 1,
      "is_solution": false
    }
  ],
  "tags": [
    "csharp",
    "file-io",
    "geometry",
    "layers",
    "python"
  ],
  "has_accepted_answer": false,
  "category_id": 11,
  "posts_count": 8,
  "views": 2717
}