{
  "source_url": "https://discourse.mcneel.com/t/new-ghpython-issues-crashing-multithreading-performance/4817",
  "topic_id": 4817,
  "title": "New ghpython issues: crashing, multithreading performance",
  "question": "att: \n@stevebaer\n\n\nI have a few questions/issues with the latest release of ghpython.\n\n\nFirst - I have an issue with the python editor crashing intermittently. This has even happened when making a modification to the script \n@stevebaer\n provided on his blog: “ghpython_components_sample2.gh”. Simply upping the plane count to 300 and making a modification to the script (adding “print(‘hey’)” after     “slices = ghpythonlib.parallel.run(slice_at_angle, planes, True)” caused rhino to crash. I cannot cause it to happen consistently, but I have noticed it several times now.\n\n\nSecond - I only rarely have success achieving a performance improvement by multi-threading a function with python. In the attached example, the parallel python script is always slower than both a non-parallel version of the same script (switched with the attached toggle) as well as the original component itself. Am I structuring my script wrong?\n\n\nThird (maybe most important) - I am concerned that some sort of memory leak is occurring. I have now noticed several times that every time a complex, multithreaded python script runs, its execution time is significantly slower than the previous time, even with identical data. In the attached definition, when I enable the python component the first time, it calculates in 8.4 seconds. If I repeatedly reconnect one of the inputs, it goes up to 13.8, then 24.8, then upwards of 2 minutes. See the attached video for one example of such a run cycle. I have edited the video for speed but you can clearly see the difference.\n\n\nFinally - I notice that sometimes with mutlithreaded python scripts, the component appears to update prematurely - downstream components will update (like the panel in the video) before the calculation is complete.\n\n\npyMT_Isovist.gh\n (19.6 KB)\n\n\npythonMTIssue.mp4\n (571.0 KB)",
  "code_blocks": [
    {
      "code": "Rhino 5 SR5 (32 bit)\nGrasshopper version: 0.9.0064\nghPython: 0.6.0.3",
      "language": "unknown",
      "author": "djordje",
      "post_number": 4,
      "is_solution": false
    }
  ],
  "tags": [
    "grasshopper",
    "python"
  ],
  "has_accepted_answer": false,
  "category_id": 11,
  "posts_count": 4,
  "views": 3169
}