{
  "source_url": "https://discourse.mcneel.com/t/how-to-use-rendermaterial-in-python-script/83226",
  "topic_id": 83226,
  "title": "How to use RenderMaterial in Python script",
  "question": "I have never worked with RenderMaterials before.  And am totally lost.  So please help me if you can. I have worked with old-style materials and get those to show up fine on the pieces trimmed from a larger mesh.\n\n\nFor this case with a Render Material the mesh, in Rendered view, looks like:\n\n\n\n\nMapWithMaterial.jpg\n720×387 130 KB\n\n\n\nIt uses a RenderMaterials I believe:\n\n\n\n\nMaterial_for_Map.png\n615×1088 52.3 KB\n\n\n\n\nI am trimming the mesh into smaller pieces being careful to retain the texture coordinates for all the mesh vertices.  After trimming, the number of vertices and texture coordinates are equal just like when I was working with textures referencing old-style materials.  But no texture is displayed on the trimmed mesh.\n\n\nSo somehow I need to apply the material to this trimmed mesh?  I got the material used by the starting mesh with:\n\n\nfrom scriptcontext import doc\nrms = [x for x in doc.RenderMaterials]\nif len(rms) > 0:\nrm = rms[0]\nsource_mat = rm\n\n\n\nIf I print out \nsource_mat\n I get:\n\n\n<Rhino.Render.NativeRenderMaterial object at 0x0000000000000089 [Rhino.Render.NativeRenderMaterial]>\n\n\nIf I print out len(rms) I get 1, so there is only 1 RenderMaterials in the starting mesh (actually doc).\n\n\nI tried to follow a suggestion on the forum to apply this material using:\n\n\n\t    dmat = DisplayMaterial(RenderMaterial.SimulatedMaterial(source_mat,True))\n\t\tdoc.RenderMaterials.Add(dmat)\n\n\n\nbut this fails with the message:\n\n\nMessage: ‘type’ object has no attribute ‘SimulatedMaterial’\n\n\nThe logic of these steps makes no sense to me.  Taking a material from the doc and then putting it back in the doc cannot make any difference to the trimmed mesh created from the larger starting mesh.  So I am obviously lost.\n\n\nWhen I work with old Materials I can get this to work with a difference set of commands.  But for RenderMaterials I am lost as to how to get the textures in the trimmed mesh to show the RenderMaterials.  Help!\n\n\nRegards,\n\nTerry.",
  "code_blocks": [
    {
      "code": "from scriptcontext import doc\nrms = [x for x in doc.RenderMaterials]\nif len(rms) > 0:\nrm = rms[0]\nsource_mat = rm",
      "language": "python",
      "author": "Terry_Chappell",
      "post_number": 1,
      "is_solution": false
    }
  ],
  "tags": [
    "file-io",
    "geometry",
    "materials",
    "mesh",
    "python"
  ],
  "has_accepted_answer": false,
  "category_id": 3,
  "posts_count": 2,
  "views": 617
}